## Tener las llaves y los valores de un diccionario

In [1]:
# Definition of dictionary
europe = {'spain':'madrid', 'france':'paris', 'germany':'berlin', 'norway':'oslo' }

# Print out the keys in europe
print(europe.keys())
print(europe.values())

dict_keys(['spain', 'france', 'germany', 'norway'])
dict_values(['madrid', 'paris', 'berlin', 'oslo'])

## Agregar a un diccionario valores y eliminarlos

In [2]:
europe['Chile'] = 'Santiago'
europe['Argentina'] = "Buenos_Aires"
print ('Con Chile ', europe)
del(europe["Chile"])
print ('Sin Chile ',  europe)

Con Chile  {'spain': 'madrid', 'france': 'paris', 'germany': 'berlin', 'norway': 'oslo', 'Chile': 'Santiago', 'Argentina': 'Buenos_Aires'}
Sin Chile  {'spain': 'madrid', 'france': 'paris', 'germany': 'berlin', 'norway': 'oslo', 'Argentina': 'Buenos_Aires'}

## Diccionario dentro de Diccionario y agregar un nuevo dato

In [3]:
europe = {'Chile': {'Capital':'Santiago', "Population" : 1.1}, 'España' : {'Capital' : 'Madrid', 'Population' : 1}}
print (europe)
europe["Peru"] = {'Capital': 'Lima', 'Population' : 2}
print (europe)

{'Chile': {'Capital': 'Santiago', 'Population': 1.1}, 'España': {'Capital': 'Madrid', 'Population': 1}}
{'Chile': {'Capital': 'Santiago', 'Population': 1.1}, 'España': {'Capital': 'Madrid', 'Population': 1}, 'Peru': {'Capital': 'Lima', 'Population': 2}}

## Crear un Dataframe a partir de un diccionario 
### Eliminar el indice de un dataframe

In [4]:
# Pre-defined lists
names = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
dr =  [True, False, False, False, True, True, True]
cpc = [809, 731, 588, 18, 200, 70, 45]

# Import pandas as pd
import pandas as pd

# Create dictionary my_dict with three key:value pairs: my_dict
my_dict ={'country':names,'drives_right':dr,'cars_per_cap':cpc}

# Build a DataFrame cars from my_dict: cars
cars = pd.DataFrame(my_dict)

# Print cars
print (my_dict)
print(cars)

# Eliminar el indice a un dataframe
print (cars.to_string(index = False))

{'country': ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt'], 'drives_right': [True, False, False, False, True, True, True], 'cars_per_cap': [809, 731, 588, 18, 200, 70, 45]}
         country  drives_right  cars_per_cap
0  United States          True           809
1      Australia         False           731
2          Japan         False           588
3          India         False            18
4         Russia          True           200
5        Morocco          True            70
6          Egypt          True            45
      country  drives_right  cars_per_cap
United States          True           809
    Australia         False           731
        Japan         False           588
        India         False            18
       Russia          True           200
      Morocco          True            70
        Egypt          True            45

## Agregar indice a un Dataframe

In [5]:
# Definition of row_labels
row_labels = ['US', 'AUS', 'JPN', 'IN', 'RU', 'MOR', 'EG']

# Specify row labels of cars
cars.index=row_labels

# Print cars again
print(cars)

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731
JPN          Japan         False           588
IN           India         False            18
RU          Russia          True           200
MOR        Morocco          True            70
EG           Egypt          True            45

## Abrir csv

In [6]:
df = pd.read_csv("cars.csv")
## Establecer que el indice esta en la columna 0
df = pd.read_csv('cars.csv', index_col = 0)

print(df['country'])
print (df[['country', 'drives_right']])

US     United States
AUS        Australia
JAP            Japan
IN             India
RU            Russia
MOR          Morocco
EG             Egypt
Name: country, dtype: object
           country  drives_right
US   United States          True
AUS      Australia         False
JAP          Japan         False
IN           India         False
RU          Russia          True
MOR        Morocco          True
EG           Egypt          True

In [7]:
## Imprime las primeras 3 Filas
print (cars[0:3]) 
## Imprime las filas Seleccionadas
print (cars.iloc[[1,2,3]])
cars.iloc[0:5] # Primeras cinco filas
cars.iloc[:, 0:5] #Primeras cinco columnas
cars.iloc[[0,3,2]] #Primera tercera y segunda fila
cars.iloc[: , [0,2,1]] #Muestra columnas primera, tercera y segunda

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731
JPN          Japan         False           588
       country  drives_right  cars_per_cap
AUS  Australia         False           731
JPN      Japan         False           588
IN       India         False            18

           country  cars_per_cap  drives_right
US   United States           809          True
AUS      Australia           731         False
JPN          Japan           588         False
IN           India            18         False
RU          Russia           200          True
MOR        Morocco            70          True
EG           Egypt            45          True

In [8]:
print (cars.iloc[:, [0,1,2]]) #

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731
JPN          Japan         False           588
IN           India         False            18
RU          Russia          True           200
MOR        Morocco          True            70
EG           Egypt          True            45

In [9]:
print (cars[['country','cars_per_cap']]) #Filtrando por columna

           country  cars_per_cap
US   United States           809
AUS      Australia           731
JPN          Japan           588
IN           India            18
RU          Russia           200
MOR        Morocco            70
EG           Egypt            45

In [10]:
print (cars[cars['cars_per_cap']>500])

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731
JPN          Japan         False           588

In [11]:
print (cars[(cars['cars_per_cap']>100) & (cars['cars_per_cap']<700)])

    country  drives_right  cars_per_cap
JPN   Japan         False           588
RU   Russia          True           200

In [12]:
import numpy as np
cpc = cars['cars_per_cap']
between = np.logical_and(cpc>100, cpc<700)
print (cars[between])

    country  drives_right  cars_per_cap
JPN   Japan         False           588
RU   Russia          True           200

In [13]:
print (cars.iloc[0:2,0:2]) #primeras dos filas y columnas

           country  drives_right
US   United States          True
AUS      Australia         False

## INSPECCIONAR DATAFRAME

In [14]:
df = pd.read_csv('homelessness.csv')
df.head()

,Unnamed: 0,region,state,individuals,family_members,state_pop
0,0,East South Central,Alabama,2570.0,864.0,4887681
1,1,Pacific,Alaska,1434.0,582.0,735139
2,2,Mountain,Arizona,7259.0,2606.0,7158024
3,3,West South Central,Arkansas,2280.0,432.0,3009733
4,4,Pacific,California,109008.0,20964.0,39461588

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      51 non-null     int64
 1   region          51 non-null     object
 2   state           51 non-null     object
 3   individuals     51 non-null     float64
 4   family_members  51 non-null     float64
 5   state_pop       51 non-null     int64
dtypes: float64(2), int64(2), object(2)
memory usage: 2.5+ KB

In [16]:
df.shape

(51, 6)

In [17]:
df.describe()

       Unnamed: 0    individuals  family_members     state_pop
count   51.000000      51.000000       51.000000  5.100000e+01
mean    25.000000    7225.784314     3504.882353  6.405637e+06
std     14.866069   15991.025083     7805.411811  7.327258e+06
min      0.000000     434.000000       75.000000  5.776010e+05
25%     12.500000    1446.500000      592.000000  1.777414e+06
50%     25.000000    3082.000000     1482.000000  4.461153e+06
75%     37.500000    6781.500000     3196.000000  7.340946e+06
max     50.000000  109008.000000    52070.000000  3.946159e+07

In [18]:
df.sort_values('individuals', ascending = False).head()

,Unnamed: 0,region,state,individuals,family_members,state_pop
4,4,Pacific,California,109008.0,20964.0,39461588
32,32,Mid-Atlantic,New York,39827.0,52070.0,19530351
9,9,South Atlantic,Florida,21443.0,9587.0,21244317
43,43,West South Central,Texas,19199.0,6111.0,28628666
47,47,Pacific,Washington,16424.0,5880.0,7523869

In [19]:
df.sort_values(['region','family_members'], ascending = ([True, False])).head()

,Unnamed: 0,region,state,individuals,family_members,state_pop
13,13,East North Central,Illinois,6752.0,3891.0,12723071
35,35,East North Central,Ohio,6929.0,3320.0,11676341
22,22,East North Central,Michigan,5209.0,3142.0,9984072
49,49,East North Central,Wisconsin,2740.0,2167.0,5807406
14,14,East North Central,Indiana,3776.0,1482.0,6695497

In [20]:
df[df['region']== 'Mountain'].head()

    Unnamed: 0    region     state  individuals  family_members  state_pop
2            2  Mountain   Arizona       7259.0          2606.0    7158024
5            5  Mountain  Colorado       7607.0          3250.0    5691287
12          12  Mountain     Idaho       1297.0           715.0    1750536
26          26  Mountain   Montana        983.0           422.0    1060665
28          28  Mountain    Nevada       7058.0           486.0    3027341

In [21]:
df[(df['family_members']<1000) & (df['region']== 'Pacific')].head()

   Unnamed: 0   region   state  individuals  family_members  state_pop
1           1  Pacific  Alaska       1434.0           582.0     735139

## .isin Filtrar por Parametros especificos de una Columna.

In [23]:
df[df['region'].isin(['Pacific', 'Mountain'])].head()

    Unnamed: 0    region       state  individuals  family_members  state_pop
1            1   Pacific      Alaska       1434.0           582.0     735139
2            2  Mountain     Arizona       7259.0          2606.0    7158024
4            4   Pacific  California     109008.0         20964.0   39461588
5            5  Mountain    Colorado       7607.0          3250.0    5691287
11          11   Pacific      Hawaii       4131.0          2399.0    1420593